IDENTIFICATION DIVISION.
    PROGRAM-ID. eeeeeeeee.
       
DATA DIVISION.
    WORKING-STORAGE SECTION. 
       01 e PIC X VALUE 0.
       
PROCEDURE DIVISION.
    MAIN-PROCEDURE.
        PERFORM UNTIL e > e  
            DISPLAY 'e'
        END-PERFORM.
    STOP RUN.
        
